Revit 2024 API
BuiltInFailures.GroupFailures.ChildrenDeletedOnGroupSwap Property
 Some dependent elements were deleted by changing group type and cannot be retained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ChildrenDeletedOnGroupSwap { get; }
Visual Basic
Public Shared ReadOnly Property ChildrenDeletedOnGroupSwap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ChildrenDeletedOnGroupSwap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace